lilag-dawg/OSS_MCU/BLE_p2pRouteur/STM32_WPAN/App/p2p_routeur_app.c
/* USER CODE BEGIN FD_PUBLIC_FUNCTIONS */

/* USER CODE END FD_PUBLIC_FUNCTIONS */
/*************************************************************
 *
 * LOCAL FUNCTIONS
 *
 *************************************************************/
static void Server_Update_Service( void )
{
	switch(P2P_Router_App_Context.state){
		case EDS_CONNEX_HAND_CARA_2:
		{
		    /* USER CODE BEGIN Server_Update_Service */

			uint8_t value[20];
			uint8_t index =  P2P_Router_App_Context.NumberOfSensorNearbyStruct.CurrentPosition;

			if(strcmp(devicesList[index].deviceName, P2P_Router_App_Context.PairingRequestStruct.SensorName) == 0){
				devicesList[index].pairingStatus = P2P_Router_App_Context.PairingRequestStruct.Pairing;
			}

			value[0] = (uint8_t)((devicesList[index].position) << 1) + devicesList[index].pairingStatus; // PPPP PPPC

		    //green led is on when notifying
		    HAL_GPIO_TogglePin(GPIOB, GPIO_PIN_0);

			printf("Size: %d \n\r",sizeof(devicesList[index].deviceName));
			printf("Position: %d \n\r",devicesList[index].position);
			printf("[");

			printf("%x,",value[0]);

			for(int i = 1; i<(sizeof(value));i++){
				value[i] = (uint8_t)(devicesList[index].deviceName[i-1]);
				printf("%x,",value[i]);
			}

			P2P_Router_App_Context.NumberOfSensorNearbyStruct.CurrentPosition ++;

			if (P2P_Router_App_Context.NumberOfSensorNearbyStruct.CurrentPosition >= device_list_index){
				P2P_Router_App_Context.NumberOfSensorNearbyStruct.CurrentPosition = 0;
			}

			printf("]\n\r");

			EDS_STM_Update_Char(0x0000,(uint8_t *)&value);
		}

			break;
		case EDS_CONNEX_HAND_CARA_4:
		{
			uint8_t value[20];
			uint8_t index =  P2P_Router_App_Context.NumberOfSensorNearbyStruct.CurrentPosition;

			uint8_t isCadenceSupported = (uint8_t)((devicesList[index].supportedDataType.cadence) << 4);
			uint8_t isSpeedSupported = (uint8_t)((devicesList[index].supportedDataType.speed) << 3);
			uint8_t isPowerSupported = (uint8_t)((devicesList[index].supportedDataType.power) << 2);
			uint8_t isBatteryupported = (uint8_t)((devicesList[index].supportedDataType.battery) << 1);
			uint8_t isGearSupported = (uint8_t)((devicesList[index].supportedDataType.gear));


			value[0] = (uint8_t)(isCadenceSupported + isSpeedSupported + isPowerSupported + isBatteryupported + isGearSupported);

			for(int i = 1; i<(sizeof(value));i++){
				value[i] = (uint8_t)(devicesList[index].deviceName[i-1]);
			}

			P2P_Router_App_Context.NumberOfSensorNearbyStruct.CurrentPosition ++;

			if (P2P_Router_App_Context.NumberOfSensorNearbyStruct.CurrentPosition >= device_list_index){
				P2P_Router_App_Context.NumberOfSensorNearbyStruct.CurrentPosition = 0;
			}

			printf("[");

			for(int i = 0; i<(sizeof(value));i++){
				printf("%d,",value[i]);
			}

			printf("]\n\r");

			EDS_STM_Update_Char(0x0003,(uint8_t *)&value);

		}
			break;
	    default:

	        break;
	}

    return;
}

/**
 * @brief  Feature Characteristic update
 * @param  pFeatureValue: The address of the new value to be written
 * @retval None
 */

static void Client_Update_Service( void )
{
	  uint16_t enable = 0x0001;
	  uint16_t disable = 0x0000;

	  uint8_t index;

	  index = 0;
	  while((index < BLE_CFG_CLT_MAX_NBR_CB) &&
	          (aP2PClientContext[index].state != APP_BLE_IDLE))
	  {


	    switch(aP2PClientContext[index].state)
	    {

	      case APP_BLE_DISCOVER_SERVICES:
	        APP_DBG_MSG("P2P_DISCOVER_SERVICES\n");
	        break;
	      case APP_BLE_DISCOVER_CHARACS:
	        APP_DBG_MSG("* GATT : Discover P2P Characteristics\n");
	        aci_gatt_disc_all_char_of_service(aP2PClientContext[index].connHandle,
	                                          aP2PClientContext[index].P2PServiceHandle,
	                                          aP2PClientContext[index].P2PServiceEndHandle);

	        break;
	      case APP_BLE_DISCOVER_WRITE_DESC: /* Not Used - No decriptor */
	        APP_DBG_MSG("* GATT : Discover Descriptor of TX - Write Characteritic\n");
	        aci_gatt_disc_all_char_desc(aP2PClientContext[index].connHandle,
	                                    aP2PClientContext[index].P2PWriteToServerCharHdle,
	                                    aP2PClientContext[index].P2PWriteToServerCharHdle+2);

	        break;
	      case APP_BLE_DISCOVER_NOTIFICATION_CHAR_DESC:
	        APP_DBG_MSG("* GATT : Discover Descriptor of Rx - Notification Characteritic\n");
	        aci_gatt_disc_all_char_desc(aP2PClientContext[index].connHandle,
	                                    aP2PClientContext[index].P2PNotificationCharHdle,
	                                    aP2PClientContext[index].P2PNotificationCharHdle+2);

	        break;
	      case APP_BLE_READ_CHARACS:
	        APP_DBG_MSG("* GATT : Discover Reading characs - \n");
	        aci_gatt_read_char_value(aP2PClientContext[index].connHandle,
	        	                      aP2PClientContext[index].P2PReadCharHdle);

	        aP2PClientContext[index].state = APP_BLE_DISCOVER_NOTIFICATION_CHAR_DESC;
	        break;
	      case APP_BLE_ENABLE_NOTIFICATION_DESC:
	        APP_DBG_MSG("* GATT : Enable Server Notification\n");
	        aci_gatt_write_char_desc(aP2PClientContext[index].connHandle,
	                                 aP2PClientContext[index].P2PNotificationDescHandle,
	                                 2,
	                                 (uint8_t *)&enable);

	        aP2PClientContext[index].state = APP_BLE_CONNECTED_CLIENT;
	        BSP_LED_Off(LED_RED);

	        break;
	      case APP_BLE_DISABLE_NOTIFICATION_DESC :
	        APP_DBG_MSG("* GATT : Disable Server Notification\n");
	        aci_gatt_write_char_desc(aP2PClientContext[index].connHandle,
	                                 aP2PClientContext[index].P2PNotificationDescHandle,
	                                 2,
	                                 (uint8_t *)&disable);

	        aP2PClientContext[index].state = APP_BLE_CONNECTED_CLIENT;

	        break;
	      default:
	        break;
	    }
	    index++;
	  }
	  return;
}

static SVCCTL_EvtAckStatus_t Client_Event_Handler(void *Event)
{
    /* USER CODE BEGIN Client_Event_Handler_1 */

    /* USER CODE END Client_Event_Handler_1 */
    SVCCTL_EvtAckStatus_t return_value;
    hci_event_pckt *event_pckt;
    evt_blue_aci *blue_evt;
    P2P_Client_App_Notification_evt_t Notification;
    return_value = SVCCTL_EvtNotAck;
    event_pckt = (hci_event_pckt *)(((hci_uart_pckt*)Event)->data);
    int sensorIndex = 0;

    switch(event_pckt->evt)
    {
        case EVT_VENDOR:
        {
            /* USER CODE BEGIN EVT_VENDOR */

            /* USER CODE END EVT_VENDOR */
            blue_evt = (evt_blue_aci*)event_pckt->data;
            switch(blue_evt->ecode)
            {
            /* USER CODE BEGIN ecode */

            /* USER CODE END ecode */
                case EVT_BLUE_ATT_READ_BY_GROUP_TYPE_RESP:
                {
                    /* USER CODE BEGIN EVT_BLUE_ATT_READ_BY_GROUP_TYPE_RESP */

                    /* USER CODE END EVT_BLUE_ATT_READ_BY_GROUP_TYPE_RESP */
                    aci_att_read_by_group_type_resp_event_rp0 *pr = (void*)blue_evt->data;
                    uint8_t numServ, i, idx;
                    uint16_t uuid, handle;

